<?php

/*
 * This file is part of the number to word package.
 *
 * (c) Nasser Hekmati <hekmati.nasser@gmail.com>
 *
 * For the full copyright and license information, please view the LICENSE
 * file that was distributed with this source code.
 */

return array(
    'd1' => array(
        0 => 'صفر',
        1 => 'یک',
        2 => 'دو',
        3 => 'سه',
        4 => 'چهار',
        5 => 'پنج',
        6 => 'شش',
        7 => 'هفت',
        8 => 'هشت',
        9 => 'نه',
    ),
    'd2-1' => array(
        1 => 'یازده',
        2 => 'دوازده',
        3 => 'سیزده',
        4 => 'چهارده',
        5 => 'پانزده',
        6 => 'شانزده',
        7 => 'هفده',
        8 => 'هجده',
        9 => 'نوزده',
    ),
    'd2-2' => array(
        1 => 'ده',
        2 => 'بیست',
        3 => 'سی',
        4 => 'چهل',
        5 => 'پنجاه',
        6 => 'شصت',
        7 => 'هفتاد',
        8 => 'هشتاد',
        9 => 'نود'
    ),
    'd3' => array(
        1 => 'صد',
        2 => 'دویست',
        3 => 'سیصد',
        4 => 'چهارصد',
        5 => 'پانصد',
        6 => 'ششصد',
        7 => 'هفتصد',
        8 => 'هشتصد',
        9 => 'نهصد',
    ),
    'step' => array(
        1 => 'هزار',
        2 => 'میلیون',
        3 => 'میلیارد',
        4 => 'بیلیون',
        5 => 'تریلیون',
        6 => 'کادریلیون',
        7 => 'کوینتریلیون',
        8 => 'سکستریلیون',
        9 => 'سپتریلیون',
        10 => 'اکتریلیون',
        11 => 'نونیلیون',
        12 => 'دسیلیون',
    ),
    'and' => 'و',
    'currency' => 'ریال',
);